#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.eks.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-003c3de41c8944776]
module.eks.module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/MyFirstCluster/cluster]
module.eks.module.eks.aws_iam_role.this[0]: Refreshing state... [id=MyFirstCluster-cluster-20220119055614355500000001]
module.eks.aws_iam_role.node[0]: Refreshing state... [id=MyFirstCluster-eks-node-group]
module.eks.aws_iam_role_policy_attachment.node["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=MyFirstCluster-eks-node-group-20220119055615325900000005]
module.eks.aws_iam_role_policy_attachment.node["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=MyFirstCluster-eks-node-group-20220119055615342800000008]
module.eks.aws_iam_role_policy_attachment.node["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=MyFirstCluster-eks-node-group-20220119055615342300000007]
module.eks.module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"]: Refreshing state... [id=MyFirstCluster-cluster-20220119055614355500000001-20220119055615331900000006]
module.eks.module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"]: Refreshing state... [id=MyFirstCluster-cluster-20220119055614355500000001-20220119055615351600000009]
module.eks.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-086bcaa7bc4e8740f]
module.eks.module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_security_group.this[0]: Refreshing state... [id=sg-0daac85c085b2af96]
module.eks.module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0bc612ea6ffe1f5c0]
module.eks.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0a7d6b80ace03a82b]
module.eks.module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-005d1f45cdecf8bec]
module.eks.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0c7189c44881a10da]
module.eks.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0396487828a1a299b]
module.eks.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-06db3baf877f4ebdf]
module.eks.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0c7189c44881a10da1080289494]
module.eks.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-02ff31c3304a331e3]
module.eks.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0512f022719f23363]
module.eks.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-000145358ebe7eefa]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-1625618301]
module.eks.module.eks.aws_security_group_rule.node["egress_ntp_tcp"]: Refreshing state... [id=sgrule-3769105222]
module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-2902640839]
module.eks.module.eks.aws_security_group_rule.node["egress_self_coredns_tcp"]: Refreshing state... [id=sgrule-209130388]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1557902965]
module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-157117224]
module.eks.module.eks.aws_security_group_rule.node["egress_cluster_443"]: Refreshing state... [id=sgrule-1955184787]
module.eks.module.eks.aws_security_group_rule.node["egress_https"]: Refreshing state... [id=sgrule-1064945240]
module.eks.module.eks.aws_security_group_rule.node["egress_self_coredns_udp"]: Refreshing state... [id=sgrule-2182124018]
module.eks.module.eks.aws_security_group_rule.node["egress_ntp_udp"]: Refreshing state... [id=sgrule-2654592587]
module.eks.module.eks.aws_security_group_rule.cluster["egress_nodes_443"]: Refreshing state... [id=sgrule-844389542]
module.eks.module.eks.aws_security_group_rule.cluster["egress_nodes_kubelet"]: Refreshing state... [id=sgrule-3128288051]
module.eks.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1709947400]
module.eks.module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=MyFirstCluster]
module.eks.module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_launch_template.this[0]: Refreshing state... [id=lt-02f91b9dbdee71058]
module.eks.module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_eks_node_group.this[0]: Refreshing state... [id=MyFirstCluster:memory_optimized_large-2022011906072209120000000c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.eks.module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_eks_node_group.this[0] will be updated in-place
  ~ resource "aws_eks_node_group" "this" {
        id                     = "MyFirstCluster:memory_optimized_large-2022011906072209120000000c"
        tags                   = {
            "Name" = "memory_optimized_large"
        }
        # (16 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-02f91b9dbdee71058"
            name    = "memory_optimized_large-2022011906071988520000000a"
          ~ version = "2" -> (known after apply)
        }



        # (3 unchanged blocks hidden)
    }

  # module.eks.module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_launch_template.this[0] will be updated in-place
  ~ resource "aws_launch_template" "this" {
      ~ default_version         = 2 -> (known after apply)
        id                      = "lt-02f91b9dbdee71058"
      ~ latest_version          = 2 -> (known after apply)
        name                    = "memory_optimized_large-2022011906071988520000000a"
        tags                    = {}
        # (8 unchanged attributes hidden)

      ~ metadata_options {
          ~ instance_metadata_tags      = "enabled" -> "disabled"
            # (4 unchanged attributes hidden)
        }


        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @shogotsuneto, Action: `pull_request`*